src/main/resources/contract/get-all-employees/wsdl/contract.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:sch="http://www.kn.com/springsoap"
                  xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.kn.com/springsoap"
                  targetNamespace="http://www.kn.com/springsoap">
    <wsdl:types>
        <xs:schema xmlns:ll="http://www.kn.com/springsoap" xmlns:xs="http://www.w3.org/2001/XMLSchema"
                   elementFormDefault="qualified" targetNamespace="http://www.kn.com/springsoap">

            <xs:import xmlns:tns="http://www.kn.com/springsoap" schemaLocation="../xsd/contract.xsd"/>

        </xs:schema>
    </wsdl:types>

    <wsdl:message name="getAllEmployeesRequest">
        <wsdl:part element="tns:getAllEmployeesRequest" name="getAllEmployeesRequest"/>
    </wsdl:message>

    <wsdl:message name="getEmployeeResponse">
        <wsdl:part element="tns:getEmployeeResponse" name="getEmployeeResponse"/>
    </wsdl:message>

    <wsdl:portType name="EmployeesPort">
        <wsdl:operation name="getAllEmployees">
            <wsdl:input message="tns:getAllEmployeesRequest" name="getAllEmployeesRequest"/>
            <wsdl:output message="tns:getEmployeeResponse" name="getEmployeeResponse"/>
        </wsdl:operation>
    </wsdl:portType>

    <wsdl:binding name="EmployeesPortSoap11" type="tns:EmployeesPort">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="getAllEmployees">
            <soap:operation soapAction=""/>
            <wsdl:input name="getAllEmployeesRequest">
                <soap:body use="literal"/>
            </wsdl:input>
            <wsdl:output name="getEmployeeResponse">
                <soap:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>

    <wsdl:service name="EmployeesPortService">
        <wsdl:port binding="tns:EmployeesPortSoap11" name="EmployeesPortSoap11">
            <soap:address location="http://localhost:8080/ws"/>
        </wsdl:port>
    </wsdl:service>

</wsdl:definitions>