src/main/resources/contract/get-all-employees/xsd/SSU.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <tns:getAllEmployeesRequest xmlns:tns="http://www.kn.com/springsoap">
            <tns:department>Software</tns:department>
        </tns:getAllEmployeesRequest>
    </soap:Body>
</soap:Envelope>